Revit 2016 API
ExternalServices.BuiltInExternalServices.PipeFittingAndAccessoryPressureDropService Property
 The external service which permits registration of an alternate implementation for pipe fitting and accessory pressure drop calculation.
Namespace: Autodesk.Revit.DB.ExternalService
Assembly: RevitAPI (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
Syntax
C#
public static ExternalServiceId PipeFittingAndAccessoryPressureDropService { get; }
Visual Basic
Public Shared ReadOnly Property PipeFittingAndAccessoryPressureDropService As ExternalServiceId
	Get
Visual C++
public:
static property ExternalServiceId^ PipeFittingAndAccessoryPressureDropService {
	ExternalServiceId^ get ();
}
See Also
ExternalServices.BuiltInExternalServices Class
Autodesk.Revit.DB.ExternalService Namespace